<template>
  <div class="md:container md:mx-auto">
    <div class="charts-map" ref="chartDomRef"></div>
  </div>
</template>

<script setup>
import { onMounted, ref } from 'vue';
import { IsMedia } from '../../utils/index';
import china from './china.json';

const chartDomRef = ref(null);

//https://www.google.com/maps 查询坐标
let footprint = [
  [33.39076295809011, 109.8069952653452], //商洛
  [34.265088968502866, 108.95024945477402], //西安 2011
  [34.6096480104217, 108.48723804025089], //咸阳 2017
  [30.608439333764853, 104.07191888366381], //成都 2018
  [36.62606210846314, 101.78997595640057], //西宁 2019
  [36.91342612743801, 100.09243860466682], //青海湖
  [34.75231283443789, 106.50461274792572], //宝鸡
  [33.11517652657251, 107.06296612985867], //汉中 2020
  [22.81804671389275, 108.36411157462854], //南宁 2022
  [21.455419963427268, 109.1304633189505], //北海
  [22.81975309557381, 106.82197859551223], //崇左
  [36.071273927765375, 120.37562258224959], //青岛 2023
  [24.510927756330577, 117.65377366577064], //漳州
  [26.072603428811814, 119.29949096240252], //福州
  [24.494326102214718, 118.13967444423031], //厦门
  [23.687177337241792, 117.43557011619761], //东山岛
  [30.142162418139925, 118.17532735830969], //黄山
  [22.32851658753095, 114.17575248396336], //香港
  [22.196944412030653, 113.54105162106022], //澳门
  [31.110815569285716, 102.90325641348434], //四姑娘山 2024
  [30.033013581829877, 101.9629193468851], //木格措
  [30.009466813648647, 103.04416636409177], //雅安
  [36.919410544027315, 121.53716624090671], //乳山市
  [37.51989232507069, 122.11106477078646], //威海市
  [37.45932668985068, 121.45094555609734], //烟台市
  [43.828123127470654, 87.62111409309944], //乌鲁木齐
  [44.37451021659652, 84.30455275210899], //乌苏市
  [44.60632540263776, 81.3141822184842], //赛里木湖
  [43.90957167943459, 81.27708645535601], //伊宁市
  [43.296820219101306, 84.23052379664968], //那拉提
  [37.557685602850796, 126.98442713920417], //首尔
  [35.18278033722124, 129.0707283203815], //釜山
  [29.65982937275121, 91.1343352335305], //拉萨 2025
  [29.65140657577963, 94.42049102820424], //林芝
  [30.73020860821244, 90.66478509108275], //纳木错
  [30.007222171223457, 93.91370995734012], //巴松措
  [29.61669037355501, 94.95108055049327], //雅鲁藏布大峡谷
  [38.969572506315664, 113.60474325244523], //五台山
  [39.181481129763895, 112.83399428740974], //雁门关
  [37.37391788589756, 112.7785241263228], //平遥古城
  [20.04547273820169, 110.197330933251], //海口
  [19.538837177926258, 110.79832188906887], //文昌
  [18.794279133699312, 110.38895237776002], //万宁
  [18.259724303447776, 109.50717220998865], //三亚
  [39.61126458838505, 109.77115986345035], //鄂尔多斯
  [46.07213257176879, 122.09551528943904], //乌兰浩特
  [47.28412015541581, 120.42260543002739], //阿尔山
  [49.59482280579526, 117.38222156320363], //满洲里
  [49.22323271243972, 119.97967598358481], //呼伦贝尔
  // [35.67993607757777, 139.77121006698903], //东京
  // [34.66938229659487, 135.5080069427568], //大阪
  // [33.50606889266476, 126.5193732438836], //济州
  // [-36.84841493203778, 174.77676976579397], //奥兰克 2026
  // [-41.28388247171658, 174.77295084610657], //惠灵顿
];

footprint = footprint.map(([longitude, latitude]) => [latitude, longitude]);

const echartsDraw = async () => {
  const echarts = await import('echarts'); // 👈 这里动态引入
  echarts.registerMap('china', china);

  const chartDom = chartDomRef.value;
  const myChart = echarts.init(chartDom);
  chartDom.removeAttribute('_echarts_instance_');
  const frequencyScatter = footprint.map(item => ({ value: item }));
  const option = {
    title: {
      show: true,
      text: '我的足跡',
      textStyle: {
        fontSize: 16,
        color: '#999',
      },
      left: 'center',
      top: '5%',
    },
    geo: {
      type: 'map',
      map: 'china',
      silent: true, //取消鼠标移入事件

      // roam: true,
      zoom: 1.4,
      regions: [
        {
          name: '南海诸岛',
          itemStyle: {
            // 隐藏地图
            opacity: 0, // 为 0 时不绘制该图形
          },
          label: {
            show: false, // 隐藏文字
          },
        },
      ],
      itemStyle: {
        areaColor: '#00000000', //rgba设置透明度0
        borderColor: localStorage.theme === 'light' ? '#666' : '#409EFF', //省份边框颜色
        borderWidth: IsMedia() === 'm' ? 0.1 : 0.3, //省份边框
      },
    },
    series: [
      {
        data: frequencyScatter,
        type: 'effectScatter',
        coordinateSystem: 'geo',
        symbolSize: IsMedia() === 'm' ? 5 : 10,
        rippleEffect: {
          scale: IsMedia() === 'm' ? 3 : 5,
        },
      },
    ],
  };

  myChart.setOption(option);

  window.addEventListener('resize', function () {
    myChart.resize();
  });
};

onMounted(() => {
  if (typeof window !== 'undefined') {
    echartsDraw();
  }
});
</script>

<style scoped>
.charts-map {
  height: 65vw;
}

@media screen and (max-width: 768px) {
  .charts-map {
    height: 40vh;
  }
}
</style>
